Repository: Runalyze/docs
Catalog: locale/*/LC_MESSAGES/faq.po
Languages: de

source: Frequently Asked Questions
de: Häufig gestellte Fragen

source: If you have a concrete concept for a new feature, don't hesitate to submit and discuss your idea at our `Forum <https://forum.runalyze.com>`_ or at `GitHub <https://github.com/Runalyze/Runalyze/issues/new>`_. This is the best place to discuss ideas and future features with other users and developers.
de: Wenn du ein konkretes Konzept für eine neue Funktion hast, kannst du gerne deine Idee in unserem `Forum <https://forum.runalyze.com>`_ oder auf `GitHub <https://github.com/Runalyze/Runalyze/issues/new>`_ teilen. Dies ist der beste Ort, um Ideen und zukünftige Funktion mit Nutzern und Entwicklern zu diskutieren.

source: Please keep in mind that RUNALYZE is an open source project, at present based mainly on two developers offering their free time for this tool.
de: Bitte vergiss nicht, dass RUNALYZE ein Open Source Projekt ist, welches hauptsächlich von zwei Entwicklern in ihrer Freizeit entwickelt wird.

source: Annoyed by phrases like *some day* and *probably*? Strengthen our team (development, design, communication, pr, docs, ...) to speed up development.
de: Verärgert bei Wörtern wie *eines Tages* und *wahrscheinlich*? Verstärke unser Team (Entwicklung, Design Kommunikation, PR, Dokumentation...), um die Entwicklung zu beschleunigen.

source: General questions
de: Allgemeine Fragen

source: Will there be a synchronisation with other platforms?
de: Wird es eine Synchronisationsmöglichkeit mit anderen Plattformen geben?

source: Yes, definitely! Our first concern is providing an API to work with `tapiriik <https://tapiriik.com/>`_. Still, there are some months of work waiting for us until this is realizable. With every new release we are getting closer to this feature. Current schedule for this feature is in late 2017.
de: Definitiv. Für den Anfang wollen wir eine API bereitstellen, damit wie mit Portalen wie `tapiriik <https://tapiriik.com/>`_ zusammenarbeiten können. Dies wird leider noch einige Zeit dauern, bis dies umsetzbar ist. Mit jeder weiteren Version kommen wir aber einen kleinen Schritt näher. Nach aktueller Planung wird dies gegen Ende 2017 umgesetzt.

source: Will there be an app for smartphones?
de: Wird es eine App für Smartphones geben?

source: Some day, probably. So far, this is not a high priority as there are many other areas requiring our full attention.
de: Irgendwann, vielleicht. Bisher hat dies für uns keine hohe Priorität, da andere Bereiche eine höhere Aufmerksamkeit benötigen.

source: Can I publish my running diary?
de: Kann ich mein Trainingstagebuch veröffentlichen?

source: Fundamentally, RUNALYZE is in the moment not designed to be an athletes community. Our main focus is on analyzing your training.
de: RUNALYZE ist bisher nicht für eine Communityfunktion ausgelegt. Wir machen uns aber trotzdem schon Gedanken über eine solche Funktion. Unser Hauptfokus liegt auf der Analyse von Trainingseinheiten.

source: Anyway, you can mark single activities as public and share them by publishing a public url, or publish your entire list of activities. Have a look at your privacy configuration for detailed information. Furthermore, you can export any activity as html snippet or iframe and share them on twitter/facebook/google+.
de: Trotzdem kannst du einzelne Aktivität oder deine gesamte Trainingsliste als öffentlich markieren und sie über eine öffentliche URL mit Freunden teilen. Schau dir unter Konfiguration die Privatsphäre-Einstellungen für nähere Informationen an. Zudem kannst du auch jede Aktivität als HTML Code oder IFrame einbinden oder sie auf Twitter, Facebook oder Google+ teilen.

source: What are calculations and prognoses?
de: Was sind Berechnungen und Prognosen?

source: Runalyze shows an incorrect total duration
de: RUNALYZE zeigt eine falsche Gesamtzeit an

source: Most file types do not contain information about pauses. Especially tcx- and gpx-files provide no information if and when you stopped your device, e.g. at traffic lights or if you're using 'auto pause' on your device. Runalyze offers the ability to detect such breaks automatically and can remove them without further notice. Still, it's difficult or even impossible to exactly match your device's total duration.
de: Die meisten Trainingsdateitypen kennzeichnen keine Pausen. Gerade TCX- und GPX-Dateien enthalten keine Informationen, wann du deine Uhr gestoppt hast, bspw. an Ampeln oder wenn du die "Auto Pause" Funktion deiner Uhr nutzt. RUNALYZE unterstützt die automatische Erkennung solcher Pausen und entfernt diese. Trotzdem ist es schwer bzw. fast unmöglich mit dieser Erkennung die genaue Trainingsdauer zu bestimmen.

source: You can enable/disable our automatic detection of pauses in your configuration. In addition, we have an `open ticket <https://github.com/Runalyze/Runalyze/issues/913>`_ for a more flexible solution such that a specific threshold can be defined for each file separately. Feel free to leave a '+1' at GitHub.
de: Du kannst die automatische Erkennung von Pausen in der Konfiguration aktivieren/deaktivieren. Zudem haben wir noch `ein offenes Ticket <https://github.com/Runalyze/Runalyze/issues/913>`_ für eine flexiblere Lösung mit einem frei definierbaren Schwellenwert. Füge ein "+1"/Daumen hoch bei dem Ticket hinzu, wenn du dir diese Funktion wünscht.

source: Runalyze says that there are not enough results for good predictions
de: RUNALYZE sagt, dass es bisher nicht genügend Ergebnisse für gute Prognosen gibt

source: To get good predictions you need to have at least one race.
de: Um gute Prognosen zu bekommen musst du mindestens einen Wettkampf bestritten und auch als Wettkampf eingetragen haben.

source: Where can I change my maximum heart rate?
de: Wo kann ich meine maximale Herzfrequenz ändern?

source: You can edit your maximum heart rate in the "Body values" panel. You may need to activate that panel (Configuration -> Panels)
de: Du kannst deine maximale Herzfrequenz bei den "Körperdaten" Panel ändern. Das Panel muss ggf. aktiviert werden (Konfiguration -> Panels)

source: Is there an impact when I change the sport relevance?
de: Welche Auswirkung hat die Änderung der Sportrelevanz?

source: The categorization as 'main sports' and 'alternative sports' is just a preparation for future analyses. It's planned that one can group alternative sports and handle them as additional but less important training load.
de: Die Kategorisierung in "Hautsportart" und "Alternativsportart" ist nur eine Vorbereitung für zukünftige Analysen. Es ist geplant, dass man Alternativsportarten gruppieren kann und diese zusätzlich, aber bei der Trainingsbelastung weniger gewichtet.

source: The translation is missing
de: Die Übersetzung fehlt

source: Translations are maintained by our users and we cannot guarantee that everything has been translated when we roll out a new version. :doc:`You can help us! <translation>`.
de: Die Übersetzung wird von unseren Nutzern gepflegt und wir können nicht garantieren, dass alles übersetzt wurde, wenn wir eine neue Version ausrollen. :doc:`Du kannst helfen! <translation>`.

source: File import
de: Dateimport

source: The file import seems buggy? Incorrect values?
de: Die hochgeladene Trainingsdatei scheint defekt zu sein? Es werden falsche Werte ausgegeben?

source: Send us an email with your sample file and a detailed description of what your expected results. We'll have a look at your issue and will try to fix it.
de: Sende uns eine Mail mit der Beispieldatei und einer detaillierten Beschreibung der Probleme und der eigentlichen erwarteten Werte. Wir werden uns dein Problem ansehen und versuchen eine Lösung dafür zu finden.

source: The file type \*.XYZ is not supported
de: Der Dateityp \*.XYZ wird nicht unterstützt.

source: Just send us an email with some sample files and we'll have a look at this.
de: Sende uns einfach eine Mail mit Beispieldateien zu und wir werden sie uns anschauen.

source: There are some apps and devices which produces malformed files. In this case they contain negative time jumps, which we cannot process in the moment.
de: Es gibt einige Apps und Geräte, die fehlerhafte Dateien erstellen. In diesem Fall beinhalten die Dateien negative Zeitsprünge, die wir im Augenblick nicht verarbeiten können.

source: Activities
de: Aktivitäten

source: Power graph/Power data seems to be wrong
de: Wattkurve/Wattdaten scheinen falsch zu sein

source: This is maybe a bit confusing and we will change this behaviour in a later version. To import the power from your files you should disable the manual power calculation in your configuration (Activity form -> Calculate power)
de: Dies mag ein wenig verwirrend klingen und wir werden dieses Verhalten in einer späteren Version auch abändern. Wenn du die Leistungsdaten einer Datei importierst solltest du die manuelle Leistungsberechnung in deiner Konfiguration (Eingabeformular -> Leistung berechnen)

source: My activity does not show up in my race results
de: Meine Aktivität taucht nicht bei den Wettkampfergebnissen auf

source: Every activity of any sport can be marked as a race by simply checking the respective checkbox. It is not enought to change the activity type to "race". :doc:`Read more <starting-guide/races>`.
de: Jede Aktivität jeder Sportart kann als Wettkampf markiert werden. Dafür muss nur die Checkbox "Wettkampf" im Trainingsformular angewählt werden. Es reicht nicht den Trainingstypen auf "Wettkampf" zu stellen. :doc:`Mehr darüber <starting-guide/races>`.
