Repository: Runalyze/docs
Catalog: locale/*/LC_MESSAGES/features.po
Languages: de

source: Click on the green icons to see a screenshot of that feature
de: Klicke auf die grünen Icons, um ein Screenshot der Funktion zu sehen

source: **Privacy**
de: **Privatsphäre**

source: By default all your data is private and belongs to you.
de: Standardmäßig sind alle deine Daten nicht öffentlich und gehören dir.

source: But, if you want to, you can share single activities or an overview of all your activities.
de: Aber wenn du willst, kannst du auch einzelne Aktivitäten oder einen Überblick aller deiner Aktivitäten teilen.

source: Analysis
de: Analysen

source: **TRIMP principle**
de: **TRIMP Prinzip**

source: TRIMP is short for *Training Impulse* and gives you the opportunity to compare activities of different intensity levels based on this value.
de: TRIMP steht für *Training Impulse* und bietet eine Möglichkeit, die Belastung verschiedener Trainings miteinander zu vergleichen. Die Belastungswerte über einen längeren Zeitraum lassen darauf schließen, wie fit man gerade ist.

source: **Effective VO2max estimation**
de: **Schätzung des Effektiven VO2max**

source: |VO2max| is a scientific metric for the maximal oxygen uptake that is highly correlated with your maximal running performance. In addition to common calculators that estimate |VO2max| based on a race result, we estimate your effective |VO2max| for every activity based on the relation of your heart rate and pace.
de: |VO2max| ist ein Maß für die maximale Sauerstoffaufnahme, die stark mit der maximalen Laufleistung korreliert. Zusätzlich zu Standardschätzungen für Wettkampfergebnisse schätzt RUNALYZE den effektiven |VO2max| für jede einzelne Aktivität anhand von Herzfrequenz und Geschwindigkeit.

source: For more details, see :doc:`VO2max <calculations/vo2max>`.
de: Für mehr Details, siehe :doc:`VO2max <calculations/vo2max>`.

source: **Prediction**
de: **Prognose**

source: You can choose your favorite model to predict your upcoming race: CPP by Robert Bock, a simple method by Herbert Steffny, calculations by David Cameron or :doc:`VO2max <calculations/vo2max>` method.
de: Bei uns kannst du selbst wählen, welches du nutzen möchtest: Ob das CPP-Modell von Robert Bock, die simple Methode von Herbert Steffny, die Umrechnungen von David Cameron oder das :doc:`VO2max <calculations/vo2max>`-Modell.

source: **Prediction based on your shape**
de: **Prognose basierend auf deiner Form**

source: Most models predict your race performance based on your personal bests on different distances, but that does not always fit your current shape. Our :doc:`VO2max <calculations/vo2max>` estimations can be used to give much more accurate predictions.
de: Wie gut bist du jetzt gerade in Form? – Während die üblichen Prognosemodelle auf früheren Wettkampfergebnissen basieren, lässt sich aus dem geschätzten :doc:`VO2max <calculations/vdot>`-Wert eine aktuelle Prognose unabhängig von bisherigen Ergebnissen aufstellen.

source: **Monotony, training strain, stress balance**
de: **Monotonie, Trainingsbelastung, Stress Balance**

source: Additional statistics (based on TRIMP) that warn you of monotonous or too intensive training.
de: Weitere Werte (basierend auf TRIMP), die dich vor zu monotonem oder intensiven Training warnen.

source: Logging data
de: Daten erfassen

source: **Upload | Import**
de: **Hochladen | Importieren**

source: You can upload your activities in all common formats
de: Du kannst deine Aktivitäten in allen üblichen Formaten hochladen

source: The binary \*.fit format is highly recommended.
de: Das binäre \*.fit Format ist sehr empfehlenswert.

source: **FIT file specific data**
de: **FIT Datei spezifische Daten**

source: Importing HRV data, running dynamics, recovery time and more.
de: Importiere HRV Daten, Laufwerte, Erholungszeit und mehr.

source: In the future: Supporting sensor data from BSXInsight, Moxy, cosinuss° One and others.
de: In der Zukunft: Unterstützung von Sensordaten wie BSXInsight, Moxy, cosinuss° One und andere.

source: **Export**
de: **Exportieren**

source: Export single activities as \*.tcx, \*.gpx, \*.kml or \*.fitlog file.
de: Exportiere einzelne Einheiten als \*.tcx, \*.gpx, \*.kml oder \*.fitlog Datei.

source: Direct import from (*some*) garmin devices via garmin communicator.
de: Direkter Import von (*einigen*) Garmin Geräten über den Garmin Communicator.

source: **Log your...**
de: **Protokollierung von...**

source: weight, resting heart rate, body fat, body water, body muscle, sleep duration, ...
de: Gewicht, Ruhepuls, Körperfett, Körperwasseranteil, Körpermuskelanteil, Schlafdauer...

source: Activities
de: Aktivitäten

source: **Heart rate variability (HRV)**
de: **Herzfrequenzvariabilität (HRV)**

source: Several values and plots are shown for your :doc:`heart rate variability </calculations/hrv>` (as long as it's available in your files).
de: Diverse Werte und Diagramme für deine :doc:`Herzfrequenzvariabilität </calculations/hrv>` (wenn sie aufgezeichnet wird).

source: **Equipment**
de: **Ausrüstung**

source: Record your equipment for any type of sport, e.g. running shoes or bikes.
de: Zeichne auf, wie viele Kilometer/Zeit dein Equipment (egal bei welcher Sportart) schon hinter sich hat.

source: **Race results**
de: **Wettkampfergebnisse**

source: You can document your placement at races (in addition to time and distance of course).
de: Dokumentiere deine Platzierungen von Wettkämpfen (zusätzlich zur Zeit & Distanz der Strecke).

source: **Tagging**
de: **Taggen**

source: Tag your activities to easily find them again.
de: Tagge deine Aktivitäten, um sie schneller wiederzufinden.

source: **Search**
de: **Suchen**

source: You can search any activity based on various parameters.
de: Trainings können nach beliebig vielen Parametern gesucht werden.

source: **Elevation correction**
de: **Höhenkorrektur**

source: GPS-based elevation data can be corrected via satellite data.
de: GPS-Höhendaten können über Satellitendaten korrigiert werden.

source: **Elevation calculation**
de: **Höhenmeterberechnung**

source: You can choose :doc:`algorithm and settings for how your elevation value is calculated</calculations/elevation>` based on the elevation profile (as there is no truth, really).
de: Der :doc:`Algorithmus und die Parameter zur Berechnung der Höhenmeter</calculations/elevation>` können selbst festgelegt werden.

source: **Weather data**
de: **Wetterdaten**

source: Weather data (temperature, wind speed, wind direction, humdiity & pressure) can be (automatically) recorded for every outdoor activity.
de: Wetterdaten (Temperatur, Windgeschwindigkeit, Windrichtung, Luftfeuchtigkeit & Luftdruck) können (automatisch) für jede Aktivität aufgezeichnet werden.

source: Configuration
de: Konfiguration

source: **Own sport/activity types**
de: **Eigene Sportarten/Trainingstypen**

source: Define your own sport and activity types.
de: Verwende eigene Sportarten und Trainingstypen.

source: **Activity overview**
de: **Aktivitätsübersicht**

source: You can specify which values show up in the overview of your activities.
de: Du kannst festlegen, welche Werte in der Trainingsübersicht erscheinen.

source: (*Configuration -> Dataset*)
de: (*Konfiguration -> Dataset*)

source: You can publish your activities – if you want to.
de: Du kannst deine Aktivitäten veröffentlichen - wenn du willst.

source: (*Click on the chain symbol in the databrowser to open your public profile - if enabled.*)
de: (*Klicke auf das Kettensymbol im Databrowser, um den Link zu deinem öffentlichen Profil zu finden - wenn aktiviert.*)

source: **More will come in the future**
de: **Mehr folgt in der Zukunft**

source: For now we concentrate on improving the analysis and simplifying the import of activities, but there's a long list for future features.
de: Wir konzentrieren uns im Augenblick darauf die Analysen zu erweitern/zu verbessern, sowie einen einfacheren Import von Trainingsdateien zu ermöglichen. Es gibt aber eine lange Liste für zukünftige Funktionen.

source: Excited about the features? Register at `RUNALYZE <https://runalyze.com>`_ and start analyzing your training!
de: Die Funktionen begeistern dich? Dann registriere dich auf `RUNALYZE <https://runalyze.com>`_ und beginne dein Training zu analysieren!
