Repository: Runalyze/docs
Catalog: locale/*/LC_MESSAGES/knowledge-*.po
Languages: de

source: How can I delete my account?
de: Wie kann ich meinen Account löschen?

source: If you want to delete your account, open your configuration, go to *Account* and click on the link to delete your account. You'll get a confirmation email and need to click the link in the email to finally confirm the deletion of your account. All your data will be deleted immediately from our database.
de: Wenn du deinen Account löschen möchtest, dann wechsel unter Konfiguration auf den Reiter *Account* und klicke den Link zum Löschen deines Accounts. Du wirst eine Bestätigungsmail zur finalen Löschung deines Accounts erhalten. Alle Daten werden sofort aus unserer Datenbank gelöscht.

source: The data will be available in our database for maximal 30 days after your deletion. We cannot restore individual accounts.
de: Die Daten werden in unserem Backup spätestens 30 Tage nach der Löschung rausaltern. Wir können keine einzelnen Accounts wiederherstellen.

source: Enable R-R recording on Garmin 910XT
de: Aktiviere die R-R Aufnahme bei der Garmin 910XT

source: Turn on your device and enter the `Menu`. Now press UP and DOWN for 10 times. You will enter the so-called *diagnostic menu*. Select and change HRV to enable HRV data recording.
de: Schalte deine Uhr ein und drücke `Menü`. Nun drücke 10 Mal Hoch und Runter. Du wirst in ein sogenanntes *Diagnostik Menü* geleitet. Wähle und ändere dort die Option HRV, um die HRV Aufnahme zu aktivieren.

source: This does work for Garmin FR 620 as well.
de: Dies funktioniert auch bei der Garmin Forerunner 620.

source: We assume no responsibility for possible problems! You do this on your own risk. (Anyway, we enabled HRV on our devices as well and did not experience any issues so far.)
de: Wir übernehmen keine Garantie für mögliche Probleme! Du tust dies auf eigene Gefahr. (Wir haben die HRV Aufzeichnung auf unseren eigenen Uhren aktiviert und bisher keine Probleme festgestellt.)

source: Enable R-R recording on Garmin 920XT/Fenix 3
de: Aktivierung der R-R Aufnahme bei der Garmin 920XT/Fenix 3

source: Have a look at `the5krunner.com <http://the5krunner.com/2014/12/11/garmin-920xt-turn-on-hrv/>`_. You'll have to download a \*.fit file and save it on your device.
de: Siehe `the5krunner.com <http://the5krunner.com/2014/12/11/garmin-920xt-turn-on-hrv/>`_. Du musst dir dort die \*.fit Datei herunterladen und auf deiner Uhr abspeichern.

source: Get the garmin communicator running in Firefox >=Version 43
de: Hole dir den Garmin Communicator für Firefox Version >=43

source: Have a look at `blog.runalyze.com <http://blog.runalyze.com/allgemein/garmin-communicator-in-firefox-43/>`_.
de: Schaue auf unserem Blog vorbei <http://blog.runalyze.com/allgemein/garmin-communicator-in-firefox-43/>`_.
