Repository: Runalyze/docs
Catalog: locale/*/LC_MESSAGES/runalyze-testers.po
Languages: de

source: For RUNALYZE testers
de: Für RUNALYZE Tester

source: How to become a tester
de: Wie werde ich ein Tester

source: We're always looking for new tester for upcoming releases. If you own a self-hosted version of RUNALYZE and want to become a tester just drop us a mail. The next time we start a test phase you'll receive a mail.
de: Wir suchen immer nach neuen Tester für kommende Versionen. Solltest du eine Eigeninstallation von RUNALYZE betreiben und Tester werden, dann schreibe uns einfach eine Mail. Du wirst bei der nächsten Testphase eine Mail erhalten.

source: If you have an account in our official version at runalyze.com just leave us a mail with your username. You will get further information as soon as we are starting the next test phase.
de: Solltest du einen Account auf unseren offiziellen Plattform RUNALYZE.com besitzten, dann schicke uns eine Mail mit deinem Nutzernamen. Bei der nächsten Testphase wirst du weitere Informationen von uns bekommen.

source: Introduction for testers of self-hosted RUNALYZE installations
de: Anleitung für Tester einer Eigeninstallation von RUNALYZE

source: When it's time for us to start a new test phase you will receive a mail with a link to a current build of the upcoming release. In addition we will provide a list of all important changes.
de: Wenn wir in eine neue Testphase starten, wirst du eine Mail mit einer Liste aller Änderungen sowie einem Link zum Download der zukünftigen Version bekommen.

source: Your most important task is to test the update procedure itself. We will provide an update documentation for each release.
de: Die wichtigste Aufgabe besteht darin, den Updateprozess zu testen. Wir stellen für jede Version eine Dokumentation bereit.

source: Please leave us a mail, if ...
de: Bitte sende uns eine Mail, wenn ...

source: something is not understandable during the update process.
de: etwas während des Updateprozesses nicht verständlich ist.

source: the update documentation is wrong.
de: die Update Dokumentation falsch ist.

source: you have an error during the update process.
de: du Probleme während des Updateprozesses hast.

source: If there are any errors (empty pages, something does not show up, internal server error, …) it’s always important that you have a look into the „error.log“ of your webserver (nginx, apache ...) if error messages do not show up directly. In addition, please tell us which database system you're using (mySQL, mariaDB ...).
de: Sollten bei dir irgendwelche Fehler auftauchen (leere Seiten, etwas wird nicht angezeigt, Internal Server Error, ...) ist es immer wichtig, erst in die "error.log" Datei deines Webservers (nginx, apache...) zu schauen, wenn die Fehlermeldungen nicht direkt auftauchen. Bitte teile uns auch mit, welchen Datenbankserver (mySQL, mariaDB...) du nutzt.

source: Please leave a mail as well if you think everything is fine during the update process. It's important for us to know that the update is working. The more feedback we're receiving the less we have to answer support questions and can concentrate on programming new features for RUNALYZE.
de: Bitte sende uns auch eine Mail zu, wenn beim Updateprozess alles glatt lief. Es ist für uns sehr wichtig zu wissen, dass das Update reibungslos klappt. Je mehr Feedback wir bekommen, desto weniger Supportanfragen werden wir im Nachhinein haben und somit können wir uns auf die Programmierung neuer Funktionen für RUNALYZE konzentrieren.

source: We are happy that you help us to improve the quality of RUNALYZE. Feedback is always appreciated!
de: Wir sind froh, dass du uns hilfst die Qualität von RUNALYZE zu steigern. Feedback ist immer willkommen!

source: Introduction for testers of our official RUNALYZE installation
de: Anleitung für die Tester der offiziellen RUNALYZE Version

source: If you're a tester of the upcoming RUNALYZE version we will copy your data of your account at runalyze.com to a temporary installation at testing.runalyze.com. We’ll provide a list of all changes and things you definetly should test. You can simply login with your official account.
de: Wenn du ein Tester der kommenden RUNALYZE-Version bist, kopieren wir die Daten deines Kontos auf runalyze.com in eine temporäre Installation unter testing.runalyze.com. Wir bieten eine Liste aller Änderungen und Dinge, die Sie unbedingt testen sollten. Sie können sich einfach mit Ihrem offiziellen Konto anmelden.

source: Outside of the test phase it will happen that the version at testing.runalyze.com won't work. We are just updating and copying the user data for the version during the test phase.
de: Außerhalb der Testphase wird die Version unter testing.runalyze.com nicht funktioneren. Wir aktualisieren und kopieren die Nutzerdaten für die Version nur während der Testphasen.

source: Don't forget that we have to delete all data of testing.runalyze.com sometimes during and after the test phase. Just use it for this exact testing purpose - there won’t be any synchronization back to the official version at runalyze.com. Before each test phase, we’ll just import your ‘real’ data from runalyze.com again.
de: Vergiss nicht, dass wir alle Daten von testing.runalyze.com manchmal während und nach der Testphase löschen müssen. Verwende Sie nur zu genau diesem Testzweck - es wird keine Synchronisation zur offiziellen Version von runalyze.com geben. Vor jeder Testphase importieren wir einfach deine "echten" Daten erneut von runalyze.com.

source: Most of the features we are adding in upcoming releases to RUNALYZE are already tested by some candidates and by our automatic tests, but it can always happen that we make mistakes which are not covered by automatic tests.
de: Die meisten Funktionen, die wir in RUNALYZE hinzufügen, sind bereits von einigen Leuten getestet worden und werden durch automatisierte Tests abgedeckt. Es kann aber immer mal passieren, dass einige Fehler nicht durch automatisierte Tests abgedeckt sind. Deshalb brauchen wir euch!

source: Please report your problems in our `forum <https://forum.runalyze.com>`_ or leave us a mail, if ...
de: Bitte melden deine Probleme in unserem `Forum <https://forum.runalyze.com>` _ oder schreiben Sie uns eine E-Mail, wenn ...

source: something seems strange to you.
de: dir etwas komisch vorkommt.

source: something is not working the way you are expecting.
de: etwas nicht funktioniert, wie du es erwartest.

source: or you just want to say something about a new feature.
de: oder du uns nur etwas über eine neue Funktion sagen möchtest.

source: In case of an error ...
de: Sollten Fehler auftauchen ...

source: tell us what you tried to do.
de: sag uns, was du zu dem Zeitpunkt versucht hast zu tun.

source: tell us at which time you tried it (we will look into our log files).
de: sag uns, wann der Fehler auftrat (wir schauen in unseren Logs nach).
