Repository: Runalyze/docs
Catalog: locale/*/LC_MESSAGES/support.po
Languages: fr, it

source: Support
fr: Aide
it: Assistenza

source: Getting support for RUNALYZE is not hard. If you have problems or a general question about RUNALYZE, you have the following options to contact us or the community:
fr: Optenir de l'aide pour RUNALIZE n'est pas difficile. Si vous avez un problème ou une question à propos de RUNALIZE, vous avez les options suivantes pour nous contacter ou contacter la communauté:
it: Ricevere assistenza per RUNALYZE non è difficile. Se hai problemi o domande generali riguardo RUNALYZE, hai le seguenti opzioni per contattare noi o la community:

source: `Forum <https://forum.runalyze.com/>`_: You can post your question in English or German. That's the best place to reach someone who can help you.
fr: `Forum <https://forum.runalyze.com/>`_: Vous pouvez poster votre question en Anglais ou Allemand. C'est le meilleur endroit pour trouver une réponse à vos questions.
it: `Forum <https://forum.runalyze.com/>`_: Puoi postare le tue domande in Inglese o tedesco. Questo è il modo migliore per trovare qualcuno che ti dia una mano.

source: `Google+ <https://plus.google.com/communities/116260192529858591171>`_: Post your question in our Google+ community.
fr: `Google+ <https://plus.google.com/communities/116260192529858591171>`_: Posez votre question sur notre communauté Google+ .
it: `Google+ <https://plus.google.com/communities/116260192529858591171>`_: Posta le tue domande nella nostra community su Google+.

source: `Facebook <https://www.facebook.com/Runalyze>`_: Post on your question on our Facebook page or write a private message to us.
fr: `Facebook <https://www.facebook.com/Runalyze>`_: Posez votre question sur notre page Facebook page ou écrivez-nous un message privé.
it: `Facebook <https://www.facebook.com/Runalyze>`_: Posta le tue domande sulla nostra pagina Facebook o scrivici un messaggio privato.

source: How to report a problem
fr: Comment remonter un problème
it: Come segnalare un problema

source: Please check twice that you provide all needed information when reporting a problem. Inaccurate and unprecise support requests waste a lot of our time - time, that we'd love to put in the development instead.
fr: Merci de vérifier toutes les informations que vous nous données quand vous nous reportez un problème. Des demandes imprécises nous font perdre un temps précieux, temps que nous aimerions consacrer au développement de Runalyse.
it: Per favore controlla due volte di aver fornito tutte le informazioni necessarie quando segnali un problema. Le richieste di assistenza inaccurate e imprecise ci fanno sprecare molto tempo che preferiremmo invece investire nello sviluppo.

source: **Before you report a problem**
fr: **Avant de reporter un problème**
it: **Prima di segnalare un problema**

source: Make sure that you've checked our `help page <https://help.runalyze.com>`_!
fr: Assurez-vous d'avoir regardé notre `help page <https://help.runalyze.com>`_ !
it: Controlla bene di aver controllato la nostra pagina di assistenza <https://help.runalyze.com>`_!

source: Make sure that you've checked our `forum <https://forum.runalyze.com>`_ and googled before asking!
fr: Assurez vous d'avoir regardé sur notre `forum <https://forum.runalyze.com>`_ et cherché sur google avant de demander !
it: Assicurati di aver controllato sul nostro `forum <https://forum.runalyze.com>`_ e di aver cercato su google prima di chiedere!

source: **Provide all possible information**
it: **Fornisci il maggior numero di informazioni possibili**

source: Please describe your problem as detailed as possible (everything needed to reproduce your problem)
it: Per favore descrivi il tuo problema nel modo più dettagliato possibile (tutto ciò che è necessario per replicare il problema)

source: Tell us when the problem happend
it: Facci sapere quando si presenta il problema

source: Add a screenshot if you think it might help us
fr: Ajoutez une copie d'écran si vous pensez que cela peut nous aider
it: Aggiungi uno screenshot se pensi che possa aiutarci

source: In case of problems with an activity file: Add that file to your report!
fr: En cas de problème avec une fichier d'activité : Ajouter ce fichier dans votre report !
it: In caso di problemi con il file di un'attività: allega il file alla tua segnalazione!

source: Tell us which device or app you are using
fr: Indiquez nous quel appareil ou applications vous utilisez
it: Dicci che dispositivo o app stai utilizzando

source: Tell us your device's firmware if known
fr: Indiquez nous la version du microprogramme si vous la connaissez
it: Dicci quale versione del firmware ha il tuo dispositivo se la conosci

source: Use the `forum <https://forum.runalyze.com>`_ to report your problem!
fr: Utilisez le `forum <https://forum.runalyze.com>`_ pour reporter votre problème !
it: Usa il `forum <https://forum.runalyze.com>`_per segnalare il problema!

source: Report a bug
fr: Reporter un problème
it: Segnala un bug di programmazione

source: `Forum <https://forum.runalyze.com>`_: Questions are public to everyone, so that everyone can see the answer
fr: `Forum <https://forum.runalyze.com>`_ : Les questions sont publiques aussi, tout le monde pourra voir la réponse
it: `Forum <https://forum.runalyze.com>`_: le domande sono pubbliche e visibili a tutti quelli in modo che tutti possano vedere le risposte

source: `Github <https://github.com/Runalyze/Runalyze/issues/new>`_: Create a new issue at GitHub if think you discovered a bug.
fr: `Github <https://github.com/Runalyze/Runalyze/issues/new>`_: Créez une nouvelle question sur GitHub si vous pensez avoir découvert un problème.
it: `Github <https://github.com/Runalyze/Runalyze/issues/new>`_: Crea una richiesta su GitHub se credi di aver rilevato un bug di programmazione.

source: `mail@runalyze.com <mailto:mail@runalyze.com>`_: We use a ticket system with automatic integration to our Slack channel - just send an email if you want to share something with us privately.
fr: `mail@runalyze.com <mailto:mail@runalyze.com>`_: Nous utilisons un systemè de ticket avec intégration automatique à notre canal Slack - Envoyez-nous juste un mail si vous souhaitez partager quelque chose de privé avec nous seulement.
it: `mail@runalyze.com <mailto:mail@runalyze.com>`_: Utilizziamo un sistema di assegnazione automatico con integrazione al nostro canale di Slack - manda semplicemente una mail per condividere qualcosa con noi privatamente.
