Repository: Runalyze/docs
Catalog: locale/*/LC_MESSAGES/calculations/elevation.po
Languages: de, fr

source: Elevation
de: Höhenmeter
fr: Dénivelée

source: One of the most common questions at RUNALYZE is about elevation values. There is a lack of clarity regarding the elevation correction and its calculation. Many people just don't know how elevation has to be handled and why there is no proper value.
de: Eine der häufigsten Fragen bezüglich der Nutzung von Runalyze sind die Höhenmeter. Es gibt einige Wissenslücken bezüglich der Höhenmeterkorrektur und deren Berechnungen. Vielen ist nicht klar, wie umständlich die Höhenmeter gehandhabt werden müssen und warum es keine richtigen Werte gibt.
fr: Une des questions les plus répandue sur RUNALYZE porte sur les valeurs des dénivelés. Il y a un manque de transparence concernant les corrections et les calculs des dénivelés. Beaucoup de personnes ne savent simplement pas comment les dénivelés doivent être gérer et pourquoi il n'y a pas de "bonne" valeur.

source: Elevation data and elevation correction
de: Höhendaten und Höhenkorrektur
fr: Données de dénivellation et correction

source: Recording of activities
de: Aufzeichnung des Trainings
fr: Enregistrement des activités

source: Let's start with the recording of an activity. Not only the position in terms of latitude/longitude but also the elevation is determined via GPS.
de: Fangen wir mit der Aufzeichnung des Trainings an. Dabei wird durch das GPS-Signal nicht nur die Position auf der Karte in Form von Koordinaten sondern auch die Höhe ermittelt.
fr: Commençons par l'enregistrement d'une activité. Non seulement la position (latitude/longitude), mais aussi le dénivelé est mesuré par le GPS.

source: This sounds great but it isn't: Every owner of a gps-device knows that the GPS quality can vary extremely. Concerning the total distance these variations are negligible. It doesn't matter if you're running 10 meters to the left or right of the way.
de: Das klingt zwar gut, ist es aber nicht: Wie aber jeder Läufer mit GPS-Uhr weiß, schwankt die Qualität des GPS-Signals mitunter stark. Oft kann das in Bezug auf die Gesamtdistanz vernachlässigt werden. Ob man gerade 10 Meter weiter links oder rechts des Weges läuft, macht keinen großen Unterschied.
fr: Cela peut sembler bien mais en fait non: Tous les gens qui possèdent un gps savent que la qualité d'un GPS peut varier énormément. Pour les distances, ces variations sont négligeable. Celà importe peu si vous courrez 10 mètres à gauche ou à droite du chemin.

source: But the same variations apply for the recorded elevation – and for elevation it's a significant difference if you are running 10 meters higher or lower.
de: Die gleichen Schwankungen gelten aber auch für die Höhe – und ob man 10 Meter weiter oben oder unten läuft, macht im Höhenprofil durchaus einen deutlichen Unterschied.
fr: Mais les mêmes variations s'applique sur les dénivelés- et pour ceux là celà fait une différence significative si vous courrez 10 mètre plus haut ou plus bas.

source: That's why elevation data obtained via GPS is unusable and an elevation correction is used by default. This applies to any platform like Garmin Connect, Polar Flow as well.
de: Deshalb sind GPS-Höhendaten unbrauchbar und bei uns die Höhenkorrektur standardmäßig eingeschaltet. Die wird ebenso bei Garmin Connect oder SportTracks oder nahezu jedem beliebigen Anbieter durchgeführt.
fr: C'est pourquoi les données du gps ne sont pas utilisées et la correction du dénivelé est utilisé par défaut. Cela est appliqué à n'importe quelle plateforme, comme Garmin Connect ou polar Flow.

source: Elevation data from a device should only be used if the device has a barometric altimeter included.
de: Die Höhendaten der Geräte sollten nur dann genutzt werden, wenn die GPS-Uhr einen Barometer besitzt.
fr: Les données de dénivellation venant d'un capteur ne devrait être utilisé que si ce capteur à un baromètre altimétrique inclus.

source: Elevation correction via satellite data
de: Höhenkorrektur über Satellitendaten
fr: Correction du dénivelé par données satellites

source: The prinicple of elevation correction is quite simple. The respective altitude of every pair of coordinates is determined from some digital elevation model, in general an elevation profile of the global surface.
de: Das Prinzip der Höhenkorrektur ist recht einfach. Aus Datensätzen werden für alle Koordinaten der Strecke die jeweiligen Höhenangaben ermittelt.
fr: Le principe de la correction du dénivelé est simple. L'altitude respective de toutes coordonnées est déterminé à partir d'un modèle numérique de dénivellation, en général un profile d'altitude de la surface du globe.

source: An example for such a dataset are SRTM files (Shuttle Radar Topography Mission from 2000). They are freely available in a grid of 90x90m. The resolution is not perfect and these datasets are noisy, but they are usually the best fit if there are no barometric measurements.
de: Ein solcher Datensatz sind zum Beispiel die SRTM-Daten, die im Jahr 2000 aus dem Weltraum aufgezeichnet wurden (Shuttle Radar Topography Mission). Diese Daten sind in einem Raster von 90x90m frei verfügbar. Die Auflösung ist zwar nicht perfekt und auch diese Daten sind teilweise etwas verrauscht, aber sie sind in der Regel die besten Daten, die man verwenden kann.
fr: Un exemple d'un tel jeu de données sont les fichiers de SRTM (Shuttle Radar Topography Mission de 2000). Elles sont accessible gratuitement sur des grilles de 90x90m. La résolution n'est pas parfaite et les jeux de données bruitées, mais ils sont souvent le plus précis si il n'y a pas de données barométrique.

source: This dataset can be accessed via public APIs of Geonames.org or GoogleMaps, but the number of requests is limited. At RUNALYZE we're hosting our own SRTM files nowadays to get an accurate elevation profile for your activity.
de: Auch die öffentlichen Schnittstellen von Geonames.org und GoogleMap bieten diese Daten an, aber die Anzahl der Abfragen ist limitiert. Bei RUNALYZE.com hosten wir alle SRTM Dateien für die ganze Welt, damit du ein genaues Höhenprofil für deine Aktivität erhältst.
fr: Ce jeu de données put être accéder via les API publiques de Geonames.org ou GoogleMaps, mais le nombre de demandes est limité. Chez RUNALYZE, nous hébergeons nos propres fichiers SRTM pour obtenir un profil de dénivellation précis pour votre activité.

source: **Conclusion:** The best elevation profile is obtained via barometric measurements. Users with devices that do not include a barometric altimeter **should always enable the elevation correction**. But remember: This elevation correction does only mean that we correct the elevation profile (based on satellite data). This does not yield a single, "true" elevation value for your activity.
de: **Fazit:** Das beste Höhenprofil bekommst du mit einem barometrischen Höhenmesser. Nutzer ohne Barometer **sollten immer die Höhenkorrektur aktivieren**. Aber vergiss nicht: Höhenkorrektur heißt nur, dass wir das Höhenprofil (auf Basis der GPS Daten) korrigieren. Dies ergibt noch längst nicht den "richtigen" Höhenwert.
fr: **Conclusion:** Le meilleur profile de dénivellation est obtenue via des mesures barométriques. Les utilisateurs avec des appareils qui n'inclus pas d'altimètre barométrique **devrait toujours activer la correction du dénivelé**. Mais souvenez-vous : la correction de dénivelé signifie seulement que nous corrigeons le profil de dénivellation (basé sur les données satelitte). Cela ne donne pas la "vraie" dénivellation de votre activité.

source: The calculation of the elevation value (total ascent/descent)
de: Die Berechnung der Höhenmeter (Summe Bergauf/Bergab)
fr: Le calcul du dénivelé (Total Montée/Descente)

source: The problem
de: Die Problematik
fr: Le problème

source: Most runners do not only want to see a nice elevation profile. They are interested in their total elevation gain (sometimes just called "elevation" of an activity).
de: Die meisten Läufer wollen nicht nur ein schönes Höhenprofil sehen. Sie wollen auch den den genauen Wert der Höhenmeter wissen. (Wie viel bin ich bergauf/bergab gelaufen?).
fr: La plupart des coureurs ne veulent pas seulement voir un bon profil de dénivellation. Ils s'intéressent à leur dénivelé positif total (parfois appelé «dénivelé» d'une activité).

source: But - and that's probably new to you as you're forced to read this article - obtaining such a value is far away from trivial. Most people think that a fixed elevation profile generates a fixed elevation value, but that's not true.
de: Aber - und das ist wahrscheinlich auch der Grund, wieso du diesen Artikel liest - diese Werte zu bestimmen ist nicht ganz trivial. Die Meisten denken, dass ein festes Höhenprofil einen fixen Höhenmeterwert ergibt, aber das stimmt so nicht.
fr: Mais - cela est peut être nouveau pour vous, comme vous êtes obligés de lire cet article - obtenir une telle valeur est loin d'être trivial. La plus part des gens pense qu'un profile fixe de dénivellation génère une valeur fixe de dénivelé, mais ce n'est pas vrai.

source: The problem is that there is no "real" value. Ask yourself: How would do you define this elevation value? As sum of all differences in altitude? Even if it's only 10cm of a sidewalk? And what's with small stones under your feet or potholes?
de: Das Problem ist, dass es keine "echten" Werte gibt. Frage dich mal selbst: Wie würdest du die Höhenmeter definieren? Als Summe aller Höhenunterschiede? Auch wenn es nur 10cm Unterschied sind? Oder was ist mit Steinen oder Schlaglöchern?
fr: Le problème est qu'il n'y a pas de "vraie" valeur. Demandez-vous : Comment vous définiriez une valeur de dénivellation? Comme une somme de toutes les différences d'altitude? Même si c'est seulement une marche de 10cm? Et qu'en est-il des petites pierres sous vos pieds ou des nids de poules?

source: Be sure: That's not what you want. It's simple to calculate the total elevation of a steady uphill course: highest point - lowest point = elevation gain. But that's not possible for hilly terrains and urban areas.
de: Wir versichern dir, dass es nicht das ist was du willst. Es ist einfach den gesamten Anstieg von einer ständig ansteigenden Route zu errechnen: höchster Punkt - tiefster Punkt = Anstieg. Die ist für hügelige und städtische Gebiete nicht so möglich.
fr: Soyez sûr: Ce n'est pas ce que vous voulez. C'est simple de calculer la dénivellation totale d'un parcours ascendant constant: point le plus haut - point le plus bas = dénivelé positif. Mais celà n'est pas possible pour les terrains vallonnés ou les zones urbaines.

source: The solution: smoothing algorithms
de: Die Lösung: Glättungsalgorithmen
fr: La solution: les algorithmes de lissage

source: Our workaround is to "smooth" the elevation profile (only for calculating total elevation). RUNALYZE currently supports three methods:
de: Um das Problem zu umgehen, können die Höhendaten für die Berechnung „geglättet“ werden. Dabei unterstützt Runalyze derzeit drei Methoden:
fr: Une solution de contournement est de "lisser" le profile de dénivellation (seulement pour calculer le dénivelé Total). RUNALYZE supporte actuellement 3 méthodes:

source: No smoothing
de: keine Glättung
fr: Pas de lissage

source: Threshold method
de: Schwellenwert-Methode
fr: Méthode de seuil

source: `Douglas-Peucker-Algorithm <https://en.wikipedia.org/wiki/Ramer%E2%80%93Douglas%E2%80%93Peucker_algorithm>`_
de: `Douglas-Peucker-Algorithmus <https://en.wikipedia.org/wiki/Ramer%E2%80%93Douglas%E2%80%93Peucker_algorithm>`_
fr: `Douglas-Peucker-Algorithm <https://en.wikipedia.org/wiki/Ramer%E 12%80% 293Douglas%E 32%80% 493Peucker_algorithm>`_

source: **No smoothing** is the naive approach to sum up all ups and downs. You can always change the smoothing algorithm in your settings – afterwards you can let RUNALYZE recalculate all elevation values (Tools -> database cleanup -> Loop through activities (activate "Recalculate elevation" & "Recalculate VDOT values")). You will notice that without smoothing far too high values will appear.
de: **Keine Glättung** entspricht dem naiven Ansatz, jedes Auf und Ab zu summieren. Ihr könnt die Einstellungen beliebig umstellen, im Anschluss jeweils über Tools -> Datenbank-Cleanup -> „Höhenmeter neu berechnen und VDOT anpassen“ die Glättung ausprobieren. Ihr werdet merken, dass ohne Glättung viel zu hohe Werte entstehen.
fr: **Sans lissage** est l'approche naïve qui consiste à sommer toutes les dénivellations positives et négatives. Vous pouvez toujours changer l'algorithme de lissage dans vos réglages - après vous pouvez laisser RUNALYZE recalculer toutes les valeurs de dénivellation (Outils -> nettoyage de la base de données-> Boucle sur toues les activités (activer "Recalcul du dénivellé" & "Recalcul des valeurs VDOT")). Vous noterez que sans lissage des valeurs excessives apparaîtront.

source: In the **threshold method** small elevation differences are ignored. The threshold for this can be adjusted in the configuration. We have achieved good results with a threshold of 3 meters. Therefore any difference of only one or two meters is ignored.
de: Bei der **Schwellenwert-Methode** werden geringe Höhenunterschiede ignoriert. Der Schwellenwert hierfür kann in der Konfiguration angepasst werden. Normalerweise liefert ein Schwellenwert von 3m vernünftige Ergebnisse. Dabei wird also jeder Höhenunterschied von nur ein oder zwei Metern ignoriert.
fr: Dans la **Méthode de seuil** les petites différence de dénivellation sont ignorées. La valeur du seuil peut être ajustée dans la configuration. NOus obtenons des résultats cohérents avec un seuil à 3 mètres. Par conséquent les différence de seulement 1 ou 2 mètres sont ignorées.

source: If you are moving just slowly uphill or downhill on a course the threshold method will have a problem. All elevation differences between two consecutive data points that are smaller than the threshold will be ignored. That's where the Douglas-Peucker-algorithm comes into play.
de: Problematisch ist das natürlich, wenn man kontinuierlich ganz langsam bergauf läuft. Wenn die einzelnen Höhenunterschiede zwischen den Datenpunkten zu gering sind, wird ein viel zu geringer Wert berechnet. Abhilfe schafft hierbei der Douglas-Peucker-Algorithmus.
fr: Si vous allez doucement seulement à la montée ou à la descente la méthode du seuil peu poser problème. Toutes les diférence de dénivellation entre 2 données consécutives sont trop petite par rapport au seuil et sont donc ignorées. C'est là que l'algorithme de DOUGLAS-Peucker entre en jeu.

source: The Douglas-Peucker-algorithm ignores some intermediate values (according to a certain algorithm) and tries to consider only significant "ups and downs".
de: Dieser ignoriert einige der Zwischenwerte (nach bestimmten Algorithmus) und beachtet daher nur deutliche „Höhen und Tiefen“, nicht aber kleine Wellen im Profil.
fr: L'algorithme de Doglas-Peucker ignore les valeurs intermédiaires (par rapport à un certain algorithme) et essaye de ne prendre en compte que les montées et les descentes "significatives".

source: Conclusion
de: Fazit

source: This is definitely a complicated topic and we can't set your settings such that you obtain "true" values - simply because no one knows them. There is no 'truth' in this case. But you can adapt the settings to your needs, such that you are satisfied with your calculated values. They won't match your devices values exactly, but that shouldn't be the point.
de: In der Summe klingt das sicherlich nicht ganz einfach und wir können euch keine Einstellungen vorgeben, mit denen ihr die „wahren“ Werte erhaltet, denn die kennt niemand. Ihr könnt die Einstellungen aber so an eure Bedürfnisse anpassen, damit ihr mit euren berechneten Werten zufrieden seid.
fr: C'est certainement un sujet compliqué et nous ne pouvons pas configurer vos paramètres de manière à obtenir des valeurs «vraies» - simplement parce que personne ne les connaît. Il n'y a pas de «vérité» dans ce cas. Mais vous pouvez adapter les paramètres à vos besoins,afin que vous soyez satisfait des valeurs calculées. Elles ne correspondent pas exactement aux valeurs de vos appareils, mais ce ne devrait pas être le cas.

source: The information window about the elevation data, which you can open for every activity, can help finding the correct settings.
de: Eine Hilfe kann dabei das Infofenster über Höhenmeter sein, dass ihr für jedes Training mit dem kleinen Info-Icon in der Zeile der Höhenmeter aufrufen könnt.
fr: La fenêtre d'information sur les données de dénivellation, que vous pouvez ouvrir pour chaque activité, peut aider à trouver les paramètres corrects.

source: The original data is compared with the corrected data and our different algorithms. There's a table for the different algorithms and thresholds as well.
de: Dort werden im Diagramm die Originaldaten mit den korrigierten Daten verglichen und auch die unterschiedlichen Algorithmen dargestellt und tabellarisch nach verschiedenen Schwellenwerten verglichen.
fr: Les données originales sont comparées aux données corrigées et à nos différents algorithmes. Il existe également une table pour les différents algorithmes et seuils.
