Repository: Runalyze/docs
Catalog: locale/*/LC_MESSAGES/calculations/vdot.po
Languages: de

source: VDOT is - according to the originally definition - calculated from a race result. Having a personal best for 10k, you can use the VDOT of that result to get a prognosis for a half marathon. This works pretty well, but it requires a current (and "good") race result.
de: Der VDOT wird - gemäß der originalen Definition - aus einem Wettkampfergebnis berechnet. So lässt sich aus dem VDOT der persönlichen 10 km-Bestzeit eine Prognose für einen Halbmarathon aufstellen. Das funktioniert wunderbar, benötigt aber ein aktuelles (und "gutes") Wettkampfergebnis.

source: In general, that's not sufficient. Runners want to know about their shape (i.e. optimal training paces and a prognosis for the upcoming race) while training for some event, not right after it.
de: Im Normalfall reicht das nicht. Läufer interessieren sich für ihre aktuelle Form (d.h. optimale Trainingsbereiche und eine Prognose für den nächsten Wettkampf) während sie für ein Event trainieren, nicht erst im Anschluss.

source: Therefore, RUNALYZE estimates your current VDOT based on your activities. (Again: it's an estimation - not an exact calculation!) This estimation is based on your heart rate and your running pace. Tables by Jack Daniels give a rough basis for these calculations. Your current VDOT shape is based on your average VDOT of the last 30 days.
de: Dafür schätzt RUNALYZE deinen aktuellen VDOT anhand deiner Trainingseinheiten. (Noch einmal: Es ist eine Schätzung, keine exakte Berechnung!) Diese Schätzung basiert auf dem Verhältnis von Herzfrequenz und Geschwindigkeit. Tabellen von Jack Daniels geben die Grundlage für diese Berechnungen. Deine aktuelle VDOT-Form ergibt sich dann als mittlerer VDOT der letzten 30 Tage.

source: Still, this estimation is not that easy all the time. The maximal heart rate must be known and the heart rate graph of your activity must not go haywire due to a defect heart rate strap or other influences. RUNALYZE gives you the option to ignore an activity for your VDOT estimation (e.g. for activities with long pauses) to solve this problem.
de: Leider ist diese Schätzung nicht immer ganz einfach. Die maximale Herzfrequenz muss bekannt sein und der Herzfrequenzverlauf muss zuverlässig sein, Ausreißer wegen eines defekten Gurtes oder anderer externer Einflüsse verfälschen die Werte. RUNALYZE gibt dir die Möglichkeit, einzelne Aktivitäten von der VDOT-Schätzung auszuschließen (z.B. bei Trainings mit längeren Pausen).

source: In general, we suggest a correction factor between 0.85 and 0.95.
de: Generell empfehlen wir einen Korrekturfaktor zwischen 0.85 und 0.95.

source: General
de: Allgemein

source: Speaking of *VDOT*, it's a shortened version of V-dot-O2max, the maximal oxygen uptake rate. The VDOT itself, defined and invented by Jack Daniels, equals V-dot-O2max plus some additional factors to take the runner's economy/efficiency into consideration. That's why some people call it a *pseudo V-dot-O2max*.
de: *VDOT* ist die Kurzform von V-dot-O2max, der maximalen Sauerstoffaufnahmerate. Der VDOT selbst, erfunden und definiert von Jack Daniels, ist gleich dem V-dot-O2max plus einige weitere Faktoren, die die Ökonomie und Effizienz eines Läufers berücksichtigen. Deswegen wird der VDOT teilweise auch *pseudo V-dot-O2max* genannt.

source: Each VDOT value of an activity in RUNALYZE is marked with an arrow to show if this value is (much) higher than your current shape, equal to it or (much) lower.
de: Der VDOT-Wert einer jeden Aktivität wird in RUNALYZE mit einem Pfeil dargestellt. Dieser gibt an, ob der Wert (deutlich) größer, gleich oder (deutlich) kleiner im Vergleich zu deiner aktuellen Form ist.

source: VDOT settings
de: VDOT Einstellungen

source: Manual correction factor
de: Manueller Korrekturfaktor

source: If you think your VDOT correction factor, which is based on your best competition is wrong/not perfect, you can add a manual correction factor. A correction factor between 0.85 and 0.95 should be realistic
de: Wenn du deinen aktuellen VDOT-Korrekturfaktor, der sich aus deinem "besten Wettkampf" ergibt, für falsch hältst, kannst du einen manuellen Korrekturfaktor verwenden. Wir halten Werte zwischen 0.85 und 0.95 für realistisch.

source: Adapt VDOT for elevation
de: VDOT Anpassung für Höhenmeter

source: If you make many vertical meters in your actitivies the VDOT may have a negative influence to your form. You can enable the adaption for elevation in the VDOT settings. You can set the correction per positive and negative elevation.
de: Falls du regelmäßig viele Höhenmeter überwindest, kann dies einen negativen Einfluss auf deinen VDOT haben. Du kannst daher die Distanz-Korrektur für Höhenmeter in den VDOT-Einstellungen aktivieren (und konfigurieren).

source: In addition, everybody's heart rate may behave differently but Daniels' tables are only a rule of thumb to match most people. RUNALYZE uses an additional *correction factor* which is just multiplied with the calculated value. This factor is calculated based on your *best* race and its heart rate. If this factor does not fit for you, just pick a manual factor (Configuration -> General settings -> VDOT).
de: Außerdem verhält sich die Herzfrequenz verschiedener Läufer nicht immer gleich. Die Tabellen von Daniels sind nur eine grobe Daumenregel. RUNALYZE verwendet einen zusätzlichen *Korrekturfaktor*, der lediglich mit dem ursprünglichen Wert multipliziert wird. Dieser Faktor wird aus der Herzfrequenz deines *besten* Wettkampfes ermittelt. Falls der Faktor nicht passt, kannst du einen manuellen Faktor wählen (Konfiguration -> Allgemeine Einstellungen -> VDOT).

source: Jack Daniels' famous `Running Formula* <http://amzn.to/1GnAv43>`_ contains tables for estimating this VDOT. These formulas are used to estimate your VDOT and to predict your race performances. Your personal VDOT value is estimated based on the ratio of heart rate and pace for each of your runs. The average over a given period is considered as your current shape.
de: Jack Daniels bekannte `Laufformel* <http://amzn.to/1GnAv43>`_ enthält Tabellen zum Schätzen des VDOT. Diese Tabellen werden zur Schätzung deines persönlichen VDOT und zur Wettkampfprognose verwendet. Der VDOT richtet sich nach dem Verhältnis von Herzfrequenz und Pace deiner Trainingseinheiten. Der Mittelwert eines bestimmten Zeitraums wird als deine aktuelle Form betrachtet.

source: Further readings and tools
de: Weitere Literatur und Tools

source: `VDOT calculator (german) <http://www.polar.com/us-en/support/Heart_Rate_Variability__HRV_>`_
de: `VDOT Rechner (german) <http://www.polar.com/us-en/support/Heart_Rate_Variability__HRV_>`_

source: `Threshold Training: Finding Your VDOT <http://www.runnersworld.com/workouts/threshold-training-finding-your-vdot>`_
de: `Schwellenwert-Training: Finde deinen VDOT <http://www.runnersworld.com/workouts/threshold-training-finding-your-vdot>`_

source: `VDOT - A 12 Point Guide <https://www.globe-runners.com/?q=node/181>`_
de: `VDOT - Ein 12 Punkte Anleitung (englisch) <https://www.globe-runners.com/?q=node/181>`_

source: `The Math Behind The Daniels/Gilbert Formula <http://www.simpsonassociatesinc.com/runningmath1.htm>`_
de: `Die Mathematik hinter Der Daniels/Gilbert Formel <http://www.simpsonassociatesinc.com/runningmath1.htm>`_

source: `Wikipedia about Daniels' VDOT <https://en.wikipedia.org/wiki/Jack_Daniels_%28coach%29#VDOT>`_
de: `Wikipedia über Daniels' VDOT <https://en.wikipedia.org/wiki/Jack_Daniels_%28coach%29#VDOT>`_

source: `Fellrnr about VDOT <http://fellrnr.com/wiki/VDOT>`_
de: `Fellrnr über VDOT <http://fellrnr.com/wiki/VDOT>`_
