Repository: Runalyze/docs
Catalog: locale/*/LC_MESSAGES/starting-guide/getting-started.po
Languages: de

source: Getting started
de: Erste Schritte

source: We are very happy that you joined RUNALYZE! We are a small team (`Hannes <https://blog.runalyze.com/team/hannes/>`_, `Michael <https://blog.runalyze.com/team/michael/>`_ and `Neele <https://blog.runalyze.com/team/neele/>`_), working on RUNALYZE only during leisure time. We still try to improve RUNALYZE as much as possible and adapt it to your needs every day.
de: Wir freuen uns, dich bei RUNALYZE begrüßen zu dürfen! Wir sind ein kleines Team (`Hannes <https://blog.runalyze.com/team/hannes/>`_, `Michael <https://blog.runalyze.com/team/michael/>`_, `Neele <https://blog.runalyze.com/team/neele/>`_), die in ihrer Freizeit an RUNALYZE arbeiten. Wir versuchen immer RUNALYZE weiterzuentwickeln und es an eure Bedürfnisse anzupassen.

source: You may have logged in for the first time and you may be overwhelmed by all the information so far. We can assure that you will getting comfortable after a couple of days with RUNALYZE!
de: Du hast dich vielleicht das erste Mal eingeloggt und bist etwas erschlagen von den ganzen Informationen und Daten, die du auf einen Blick siehst? Wir können dir versichern, dass sich das nach wenigen Tagen legen und du deinen Spaß mit RUNALYZE haben wirst!

source: There are three sections
de: Es gibt drei Abschnitte

source: Calendar view / databrowser
de: Kalenderansicht / Databrowser

source: Here you find a short overview of all your activities within any chosen period. You can navigate through all weeks/months/years (using the arrow icons) or select any time period (calendar icon). The set of values shown in this table is configurable. Go to "*Configuration -> Dataset*" and select the data you're most interested in.
de: Hier findest du alle deine eingetragenen Trainingseinheiten. Du kannst hier durch die Wochen, Monate oder Jahre navigieren (über die Pfeile oder auf Monat/Jahr/Woche klicken) oder einen beliebigen Zeitraum auswählen (Kalendersymbol). Welche Daten in dieser Übersicht angezeigt werden, kannst du selbst entscheiden. Unter „Konfiguration -> Dataset“ kannst du festlegen, welche Daten in dieser Übersicht für jede Trainingseinheit erscheinen sollen.

source: Statistics
de: Statistiken

source: The main focus of RUNALYZE is on statistics about your activities. We provide several "staticstic plugins" where you can find a lot of different evaluations of your activities. Be it your route map, your race results, activity records or a retrospect by the months - it's all there (and if not, just ask us to add it).
de: Das Hauptaugenmerk von RUNALYZE liegt auf den Statistiken. In Form der sogenannten „Statistik-Plugins“ werden hier verschiedenste Auswertungen deiner Sportarten und Trainingseinheiten angezeigt. Sei es das Streckennetz, deine bisherigen Wettkampfergebnisse, Trainingsrekorde oder ein monatsweiser Rückblick. (Dir fehlt etwas? Dann teile uns das mit!)

source: As always: You can decide which statistics should appear and order the active ones according to your desires ("*Configuration -> Plugins*").
de: Auch hierfür kannst du unter „Konfiguration -> Plugins“ festlegen, in welcher Reihenfolge die Statistiken erscheinen und welche unter „Sonstiges“ gruppiert werden.

source: The panels give a quick overview of the most important data. You can have a look at your shape or keep an eye on your equipment and training progress.
de: Die Panels dienen dem schnellen Überblick deiner wichtigsten Statistiken: So kannst du deine Form, dein Equipment und deine aktuellen Trainingsumfänge bestens im Blick behalten. Auch hier gilt: Die Auswahl der Panels bestimmst du selbst.

source: Configure your account
de: Konfiguriere deinen Account

source: Different countries, different units of lengths and temperatures - You can change them! RUNALYZE comes with a large set of configuration settings so that you can adjust the output at many points. Just take a look at your configuration. Whenever the meaning of a setting is unclear, hove the label with your mouse to see the tooltip with additional hints.
de: Andere Länder, andere Längen- und Temperatureinheiten - Du kannst sie ändern! RUNALYZE besitzt eine große Menge an Konfigurationseisntellungen, sodass du viel nach deinen Wünschen anpassen kannst. Klicke dich einfach mal durch die Konfiguration. Wenn dir mal eine Einstellung unklar sein sollte, dann fahre mit der Maus über die Bezeichnung, um ein Tooltip mit weiteren Hinweisen zu sehen.

source: If you have misconfigured something and can't remember the old values you can reset the configuration in your account configuration.
de: Solltest du dich verkonfiguriert haben und dich nicht mehr daran erinnern, wie die alten Werte waren, kannst du in deinen Accounteinstellungen die Konfiguration zurücksetzen.

source: Import/Create an activity
de: Importieren/Erstellen einer Aktivität

source: We provide `a guide <import.html>`_ how to import your (old) activities from several devices and platforms.
de: In `dieser Dokumentation <import.html>`_ zeigen wir dir, wie du deine (alten) Trainingseinheiten von verschiedenen Geräten und Portalen zu uns hochladen kannst.

source: We plan to provide a synchronization with other apps such that you don't need to manually upload your activities, but this work is still in progress.
de: Wir planen und arbeiten im Augenblick daran, eine Synchronisation mit anderen Apps und Portalen zu ermöglichen, sodass man später nicht mehr manuell seine Trainingseinheiten bei uns hochladen muss.

source: And, however, we think there's a clear benefit in creating/importing your activities manually. By this means you'll think about the training again and add some more details instead of hoping that the synchronization tool does all the magic for you.
de: Aktuell müsst ihr dafür selbst Hand anlegen. Für vernünftige Auswertungen ist es das aber wert – so wandern die Trainingseinheiten zumindest nicht ungesehen ins Archiv, ohne dass ihr über das Training reflektiert.

source: What can I expect from RUNALYZE in the future?
de: Was kann ich in Zukunft von RUNALYZE erwarten?

source: A new (clear, responsible) Design (the current one is 'slightly' outdated)
de: Ein neues Design (responsiv, übersichtlicher – das aktuelle ist schon ein paar Ewigkeiten alt, aber die liebe Zeit …)

source: Automatic synchronization with other apps / vendors
de: Automatische Synchronisation mit anderen Apps/Anbietern

source: Easier & clearer configuration
de: Einfachere und übersichtlichere Konfiguration

source: Better documentation of the various parameters and statistics
de: Bessere Dokumentation der verschiedenen Parameter und Statistiken

source: Optional community functions
de: Optionale Communityfunktionen (liegt im Augenblick noch weit in der Zukunft)

source: Better support for swimming and cycling
de: Bessere Unterstützung der Sportarten Schwimmen und (Renn-)Radfahren

source: "I have an idea / a question / a problem"
de: „Ich habe eine Idee, Frage oder ein Problem“

source: We are pleased to help! To ensure that all users benefit from your request we ask you to use `our forum <https://forum.runalyze.com/>`_ (english & german). Make sure first whether your question has been answered already or is part of our documentation.
de: Wir helfen dir gerne. Damit alle Nutzer von deiner Frage bzw. der Beantwortung etwas haben, bitten wir dich, unser `Forum <https://forum.runalyze.com/>`_ zu nutzen. Vergewissere dich vorher, ob deine Frage vielleicht bereits dort oder in unser Dokumentation beantwortet wurde.
