Repository: Runalyze/docs
Catalog: locale/*/LC_MESSAGES/configuration/configure-equipment.po
Languages: de

source: Equipment
de: Ausrüstung

source: We will improve the form/design for adding new equipment (objects or categories) when we have a new design.
de: Wir werden die Eingabe von neuem Equipment (Ausrüstungsobjekte und Kategorien) in einem zukünftigen neuen Design überarbeiten.

source: In version 2.2 we added a new equipment system which is a replacement for shoes and clothes we had before.
de: In der Version 2.2 haben wir ein neues Ausrüstungssystem eingeführt, welches die Schuhe und Klamotten Funktion ersetzt.

source: What can I add to the equipment?
de: Was kann ich als Ausrüstung hinzufügen?

source: Anything you want. You can add bike gear, shoes, ski gear. Just anything.
de: Alles was du möchtest. Seien es Fahrradteile, Schuhe, Skier. Einfach alles.

source: Adding an equipment category
de: Hinzufügen einer Ausrüstungskategorie

source: Go to Configuration -> Equipment to add a new equipment object/category.
de: Gehe zu Konfiguration -> Equipment, um ein neues Ausrüstungs-objekt/-kategorie hinzuzufügen.

source: If you want to add a new equipment category you have to fill out the last, greyed-out row.
de: Wenn du eine neue Ausrüstungskategorie hinzuzufügen möchtest musst du die letzte ausgegraute Zeile ausfüllen.

source: Add the name of the equipment category
de: Gebe den Namen der Ausrüstungskategorie an

source: Choose the correct type for the equipment: * Single choice = You can choose only one object for one activity * Multiple choice = You can select mulitple objects for one activity
de: Wähle den korrekten Typ für die Kategorie aus: * Einzelauswahl = Du kannst immer nur ein Ausrüstungsobjekt bei eine Aktivität auswählen * Mehrfachauswahl = Du kannst mehrere Ausrüstungsobjekte für eine Aktivität auswählen

source: You can add a maximal distance (in km) or a maximal time if you want to. This is used for displaying a progress bar in the equipment widget.
de: Du kannst eine maximale Distanz (in Kilometern) oder eine maximale Lebenszeit konfigurieren. Diese wird für die Fortschrittsanzeige im Equipment Panel genutzt.

source: You can assign a category to one or more sports types. Hold `ctrl` (Windows) or `cmd` (MacOS) to select multiple sports types.
de: Du kannst zu einer Ausrüstungskategorie mehrere Sportarten hinzufügen. Halte die Taste `strg` (Windows) oder `cmd` (MacOS) gedrückt, um mehrere Sportarten auszuwählen.

source: Attention: If you delete a category all equipment objects of this category as well as all relations between your activities and this equipment object will be deleted!
de: Achtung: Wenn du eine Kategorie löschst dann werden alle Ausrüstungsobjekte und alle Verknüpfung zwischen Aktivitäten und den Objekten gelöscht!

source: Adding an equipment object
de: Hinzufügen eines Ausrüstungsgegenstand

source: If you want to add a new equipment object you have to fill out the last, greyed-out row.
de: Wenn du eine neue Ausrüstungsobjekt hinzuzufügen möchtest musst du die letzte ausgegraute Zeile ausfüllen.

source: Add the name of your new object
de: Gebe den Namen der Ausrüstung an

source: Choose the equipment category
de: Wähle die Equipmentkategorie aus

source: If you used this for some kilometers before tracking it with RUNALYZE you can add these kilometers as previous distance.
de: Solltest du bereits vor der Nutzung von RUNALYZE eine Distanz mit deiner Ausrüstung zurückgelegt haben, kannst du diese bei "bish. Leistung" angeben.

source: Add the date when you bought or added the object to RUNALYZE
de: Füge hier das Datum ein, wann du den Ausrüstungsgegenstand gekauft oder in RUNALYZE hinzugefügt hast

source: Choose an end date if you're not using the object anymore
de: Wähle ein Endatum aus, wenn du die Ausrüstung nicht mehr nutzt

source: Leave some notes if you want (e.g. where you bought the equipment)
de: Füge Notizen zum Objekt hinzu (bspw. wo du deine Ausrüstung gekauft hast)

source: Attention: If you delete an equipment object all relations between your activities and this object will be deleted.
de: Achtung: Wenn du ein Ausrüstungsobjekt löschst, werden alle Verknüpfungen zwischen diesem Objekt und Aktivitäten gelöscht.
