Repository: Runalyze/docs
Catalog: locale/*/LC_MESSAGES/configuration/configure-sport.po
Languages: de

source: Sports
de: Sportarten

source: With this tutorial we want to show you how to add and edit a new sport.
de: In diesem Tutorial zeigen wir dir wie du eine neue Sportart hinzufügen und editieren kannst.

source: Creating a new sports type is as easily as editing an existing one: Just fill out the last, greyed-out row and click 'Save'.
de: Eine neue Sportart Hinzuzufügen ist genauso einfach wie eine existierende zu Bearbeiten: Fülle einfach die letzte - ausgegraute - Zeile aus und klicke auf 'Speichern'.

source: We are now going to explain every configuration setting:
de: Wir erklären dir nachfolgend die Einzelnen Konfigurationsmöglichkeiten im Detail:

source: Pick an icon for your sport type.
de: Wähle ein Icon für die Sportart aus.

source: Type in the name of the sport
de: Gebe den Namen der Sportarn

source: How many calories are consumed during one hour? Attention! If you import activites from a device which contains a value for calories, that value will be used. If the value is not present the calories will be calculated based on this configuration value.
de: Wie viele Kalorien verbrenne ich in einer Stunde? Achtung! Wenn du eine Aktivität von einem Gerät importierst nutzen wir den Wert von der Aktivität. Sollte dieser Wert nicht vorhanden sein berechnen wir den Wert anhand dieser Konfigurationsvariable.

source: Ø HR
de: durchschn. HF

source: You can set a default average heart rate as fallback. This value is used for TRIMP calculation.
de: Du kannst hier eine Standardwer für die durchschnittliche Herzfrequenz als Fallback angeben. Dieser wird für die TRIMP Berechnung genutzt.

source: Set a checkmark if the sport has a distance (true for e.g. running/cycling/swimming, but false for e.g. gymnastics).
de: Setze hier den Haken, wenn die Sportart eine Distanz hat (bspw. für das Laufen, Rennrad fahren, Schwimmen - Bei Gymnastik würde man kein Haken setzen).

source: Unit
de: Einheit

source: Choose a unit for displaying your speed/pace.
de: Wähle die Einheit für die Darstellung der Geschwindigkeit/der Pace aus.

source: Types
de: Trainingstypen

source: Set a checkmark if you want to add different activity types to this sport.
de: Setze hier den Haken, wenn du verschiedene Trainingstypen zur Sportart hinzufügen möchtest.

source: Set a checkmark if the power (watt) is recorded or should be calculated by RUNALYZE.
de: Set hier den Haken, wenn ein Wattwert aufgezeichnet wir oder von RUNALYZE berechnet werden soll.

source: Outside
de: Draußen

source: Set a checkmark if this sport can be performed outside. This checkbox activates the fields routes and weather in the form.
de: Setze hier den Haken, wenn die Sportart u.a. draußen betrieben wird. Diese Checkbox aktiviert das Feld "Strecke" und die Wetterangabe im Trainingsformular.

source: Calendar view
de: Kalenderansicht

source: You can choose the type of presentation of an activity in the databrowser/calendar. '*Complete row*' means that you see the complete dataset (as configured in the dataset configuration) '*Only icon*' means that only the icons of the sport shows up in the databrowser/calendar.
de: Hier kannst du den Modus der Anzeige in der Kalenderansicht/Databrowser ändern. '*Komplette Zeile*' heißt, dass du für das Training alle über das Dataset konfigurierte Felder angezeigt bekommst. '*Nur Icon*' heißt, dass für die Sportart nur das Icon im Databrowser angezeigt wird.

source: Main equipment
de: Hauptausrüstung

source: Choose a main equipment category which will be used in the databrowser view if you have activated the "Main Equipment" value to show up.
de: Wähle hier eine Hauptaurüstung aus, die im Databrowser genutzt wird, wenn du "Haupt-Ausrüstung" im Dataset aktiviert hast.

source: Default sport type
de: Standard Trainingstyp

source: Choose a default sport type which shows up if you change the sport of an activity in the form. In a later version we will use this type for automatic uploaded activities.
de: Wähle einen Trainingstypen aus, der standardmäßig u.A. im Trainingsformular ausgewählt werden soll. Später wird dieser Trainingstyp auch für die automatisch hochgeladenen Trainingstypen genutzt.
