Repository: Runalyze/docs
Catalog: locale/*/LC_MESSAGES/configuration/configure-types.po
Languages: de

source: Activity types
de: Trainingstypen

source: If you have activated the “Types” checkbox in the sport configuration of a sport, you can define different activity types.
de: Wenn du den Haken "Trainingstypen" in der Sportkonfiguration gesetzt hast, dann kannst du hier verschiedene Trainingstypen definieren.

source: For running we already added some types to make the start with RUNALYZE easy.
de: Fürs Laufen haben wir bereits einige Trainingstypen hinzugefügt, damit dir der Einstieg in RUNALYZE etwas leichter ist.

source: Activity types are useful to seperate your training into different categories.
de: Trainingstypen sind sehr sinnvoll, um dein Training in verschiedene Kategorien einzuteilen.

source: Should speak for itself. Type in the “long” name of the activity type.
de: Sollte für sich selbst sprechen. Gebe hier den Namen des Trainingstypen an.

source: Abbreviation
de: Abkürzung

source: The abbreviation is used in the databrowser and whereever the name is too long.
de: Diese Abkürzung wird im Databrowser und überall genutzt, wo der Name zu lang ist.l

source: Select the sport for this activity type.
de: Wähe die Sportart für den Trainingstyp aus.

source: Ø HR
de: durchschn. HF

source: Similar to sports configuration, the average heart rate is used as fallback for TRIMP calculation. This value overrides the one from your sports configuration.
de: Ähnlich wie bei der Sportkonfiguration kannst du hier die durchschnittliche Herzfrequenz als Fallback zur TRIMP Berechnung angeben. Dieser Wert überschreibt den Wert der Sportkonfiguration.

source: Quality?
de: Qualitätseinheit?

source: Set a checkmark if the activity type is a qualitiy session (e.g. interval workouts).
de: Setze hier den Haken, wenn der Trainingstyp eine Qualitätseinheit darstellt. (bspw. Intervalltraining)

source: Calendar view
de: Kalenderansicht

source: You can choose the typ of presentation of an activity in the databrowser/calendar. '*Complete row*' means that you see the complete dataset (as configured in the dataset configuration) '*Only icon*' means that only the icons of the sport shows up in the databrowser/calendar. This overrides the sport configuration setting.
de: Hier kannst du den Modus der Anzeige in der Kalenderansicht/Databrowser ändern. '*Komplette Zeile*' heißt, dass du für das Training alle über das Dataset konfigurierte Felder angezeigt bekommst. '*Nur Icon*' heißt, dass für den Trainingstyp nur das Icon der Sportart im Databrowser angezeigt wird. Diese Einstellung überschreibt die Einstellung der Sportkonfiguration.

source: Activity types can only be deleted if no references to activities exists.
de: Trainingstypen können nur gelöscht werden, wenn sie mit keiner Aktivität verknüpft sind.
